rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Lib/mc9s08mm128.c
/* NVBACKKEY0 - macro for reading non volatile register    Backdoor Comparison Key 0; 0x0000FFB0 */
/* Tip for register initialization in the user code:  const byte NVBACKKEY0_INIT @0x0000FFB0 = <NVBACKKEY0_INITVAL>; */
/* NVBACKKEY1 - macro for reading non volatile register    Backdoor Comparison Key 1; 0x0000FFB1 */
/* Tip for register initialization in the user code:  const byte NVBACKKEY1_INIT @0x0000FFB1 = <NVBACKKEY1_INITVAL>; */
/* NVBACKKEY2 - macro for reading non volatile register    Backdoor Comparison Key 2; 0x0000FFB2 */
/* Tip for register initialization in the user code:  const byte NVBACKKEY2_INIT @0x0000FFB2 = <NVBACKKEY2_INITVAL>; */
/* NVBACKKEY3 - macro for reading non volatile register    Backdoor Comparison Key 3; 0x0000FFB3 */
/* Tip for register initialization in the user code:  const byte NVBACKKEY3_INIT @0x0000FFB3 = <NVBACKKEY3_INITVAL>; */
/* NVBACKKEY4 - macro for reading non volatile register    Backdoor Comparison Key 4; 0x0000FFB4 */
/* Tip for register initialization in the user code:  const byte NVBACKKEY4_INIT @0x0000FFB4 = <NVBACKKEY4_INITVAL>; */
/* NVBACKKEY5 - macro for reading non volatile register    Backdoor Comparison Key 5; 0x0000FFB5 */
/* Tip for register initialization in the user code:  const byte NVBACKKEY5_INIT @0x0000FFB5 = <NVBACKKEY5_INITVAL>; */
/* NVBACKKEY6 - macro for reading non volatile register    Backdoor Comparison Key 6; 0x0000FFB6 */
/* Tip for register initialization in the user code:  const byte NVBACKKEY6_INIT @0x0000FFB6 = <NVBACKKEY6_INITVAL>; */
/* NVBACKKEY7 - macro for reading non volatile register    Backdoor Comparison Key 7; 0x0000FFB7 */
/* Tip for register initialization in the user code:  const byte NVBACKKEY7_INIT @0x0000FFB7 = <NVBACKKEY7_INITVAL>; */
/* CHKSBYP - macro for reading non volatile register       Checksum Bypass Register; 0x0000FFBA */
/* Tip for register initialization in the user code:  const byte CHKSBYP_INIT @0x0000FFBA = <CHKSBYP_INITVAL>; */
/* Partial_Erase_Semaphore - macro for reading non volatile register Flash partial erase semaphore; 0x0000FFBC */
/* Tip for register initialization in the user code:  const byte Partial_Erase_Semaphore_INIT @0x0000FFBC = <Partial_Erase_Semaphore_INITVAL>; */
/* NVPROT - macro for reading non volatile register        Nonvolatile Flash Protection Register; 0x0000FFBD */
/* Tip for register initialization in the user code:  const byte NVPROT_INIT @0x0000FFBD = <NVPROT_INITVAL>; */
/* NVOPT - macro for reading non volatile register         Nonvolatile Flash Options Register; 0x0000FFBF */
/* Tip for register initialization in the user code:  const byte NVOPT_INIT @0x0000FFBF = <NVOPT_INITVAL>; */


/* * * * *  16-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile DACDAT0STR _DACDAT0;                              /* DAC Data 0 Register; 0x00000010 */
volatile DACDAT1STR _DACDAT1;                              /* DAC Data 1 Register; 0x00000012 */
volatile DACDAT2STR _DACDAT2;                              /* DAC Data 2 Register; 0x00000014 */
volatile DACDAT3STR _DACDAT3;                              /* DAC Data 3 Register; 0x00000016 */
volatile DACDAT4STR _DACDAT4;                              /* DAC Data 4 Register; 0x00000018 */
volatile DACDAT5STR _DACDAT5;                              /* DAC Data 5 Register; 0x0000001A */
volatile DACDAT6STR _DACDAT6;                              /* DAC Data 6 Register; 0x0000001C */
volatile DACDAT7STR _DACDAT7;                              /* DAC Data 7 Register; 0x0000001E */
volatile DACDAT8STR _DACDAT8;                              /* DAC Data 8 Register; 0x00000020 */
volatile DACDAT9STR _DACDAT9;                              /* DAC Data 9 Register; 0x00000022 */
volatile DACDAT10STR _DACDAT10;                            /* DAC Data 10 Register; 0x00000024 */
volatile DACDAT11STR _DACDAT11;                            /* DAC Data 11 Register; 0x00000026 */
volatile DACDAT12STR _DACDAT12;                            /* DAC Data 12 Register; 0x00000028 */
volatile DACDAT13STR _DACDAT13;                            /* DAC Data 13 Register; 0x0000002A */
volatile DACDAT14STR _DACDAT14;                            /* DAC Data 14 Register; 0x0000002C */
volatile DACDAT15STR _DACDAT15;                            /* DAC Data 15 Register; 0x0000002E */
volatile ADCRASTR _ADCRA;                                  /* Data Result Register A; 0x0000004A */
volatile ADCRBSTR _ADCRB;                                  /* Data Result Register B; 0x0000004C */
volatile ADCRCSTR _ADCRC;                                  /* Data Result Register C; 0x0000004E */
volatile ADCRDSTR _ADCRD;                                  /* Data Result Register D; 0x00000050 */
volatile ADCRESTR _ADCRE;                                  /* Data Result Register E; 0x00000052 */
volatile ADCRFSTR _ADCRF;                                  /* Data Result Register F; 0x00000054 */
volatile ADCRGSTR _ADCRG;                                  /* Data Result Register G; 0x00000056 */
volatile ADCRHSTR _ADCRH;                                  /* Data Result Register H; 0x00000058 */
volatile IICSLTSTR _IICSLT;                                /* IIC SCL Low Time Out register; 0x00000068 */
volatile SPI1D16STR _SPI1D16;                              /* SPI1 Data Register; 0x00000074 */
volatile SPI1MSTR _SPI1M;                                  /* SPI1 Match Register; 0x00000076 */
volatile SDIDSTR _SDID;                                    /* System Device Identification Register; 0x00001806 */
volatile SCI2BDSTR _SCI2BD;                                /* SCI2 Baud Rate Register; 0x00001838 */
volatile CMTCG1STR _CMTCG1;                                /* Carrier Generator Data Register 1; 0x00001870 */
volatile CMTCG2STR _CMTCG2;                                /* Carrier Generator Data Register 2; 0x00001872 */
volatile CMTCMD12STR _CMTCMD12;                            /* CMT Modulator Data Register 12; 0x00001876 */
volatile CMTCMD34STR _CMTCMD34;                            /* CMT Modulator Data Register 34; 0x00001878 */
volatile DBGCASTR _DBGCA;                                  /* Debug Comparator A Register; 0x00001880 */
volatile DBGCBSTR _DBGCB;                                  /* Debug Comparator B Register; 0x00001882 */
volatile DBGCCSTR _DBGCC;                                  /* Debug Comparator C Register; 0x00001884 */
volatile DBGFSTR _DBGF;                                    /* Debug FIFO Register; 0x00001886 */
volatile TPM2CNTSTR _TPM2CNT;                              /* TPM2 Timer Counter Register; 0x000018A1 */
volatile TPM2MODSTR _TPM2MOD;                              /* TPM2 Timer Counter Modulo Register; 0x000018A3 */
volatile TPM2C0VSTR _TPM2C0V;                              /* TPM2 Timer Channel 0 Value Register; 0x000018A6 */
volatile TPM2C1VSTR _TPM2C1V;                              /* TPM2 Timer Channel 1 Value Register; 0x000018A9 */
volatile TPM2C2VSTR _TPM2C2V;                              /* TPM2 Timer Channel 2 Value Register; 0x000018AC */
volatile TPM2C3VSTR _TPM2C3V;                              /* TPM2 Timer Channel 3 Value Register; 0x000018AF */
volatile SCI1BDSTR _SCI1BD;                                /* SCI1 Baud Rate Register; 0x000018B8 */
volatile PDBMODSTR _PDBMOD;                                /* PDB Modulus Register; 0x000018C4 */
volatile PDBCNTSTR _PDBCNT;                                /* PDB Counter Register; 0x000018C6 */
volatile PDBIDLYSTR _PDBIDLY;                              /* PDB Interrupt Delay Register; 0x000018C8 */
volatile DACINTSTR _DACINT;                                /* DAC Trigger Interval Register; 0x000018CA */
volatile PDBDLYASTR _PDBDLYA;                              /* PDB Delay A Register; 0x000018CC */
volatile PDBDLYBSTR _PDBDLYB;                              /* PDB Delay B Register; 0x000018CE */
volatile PDBDLYCSTR _PDBDLYC;                              /* PDB Delay C Register; 0x000018D0 */
volatile PDBDLYDSTR _PDBDLYD;                              /* PDB Delay D Register; 0x000018D2 */
volatile PDBDLYESTR _PDBDLYE;                              /* PDB Delay E Register; 0x000018D4 */
volatile PDBDLYFSTR _PDBDLYF;                              /* PDB Delay F Register; 0x000018D6 */
volatile PDBDLYGSTR _PDBDLYG;                              /* PDB Delay G Register; 0x000018D8 */
volatile PDBDLYHSTR _PDBDLYH;                              /* PDB Delay H Register; 0x000018DA */
volatile TPM1CNTSTR _TPM1CNT;                              /* TPM1 Timer Counter Register; 0x000018E1 */
volatile TPM1MODSTR _TPM1MOD;                              /* TPM1 Timer Counter Modulo Register; 0x000018E3 */
volatile TPM1C0VSTR _TPM1C0V;                              /* TPM1 Timer Channel 0 Value Register; 0x000018E6 */
volatile TPM1C1VSTR _TPM1C1V;                              /* TPM1 Timer Channel 1 Value Register; 0x000018E9 */
volatile TPM1C2VSTR _TPM1C2V;                              /* TPM1 Timer Channel 2 Value Register; 0x000018EC */
volatile TPM1C3VSTR _TPM1C3V;                              /* TPM1 Timer Channel 3 Value Register; 0x000018EF */
volatile ADCCV1STR _ADCCV1;                                /* Compare Value 1 Register; 0x000018F8 */
volatile ADCCV2STR _ADCCV2;                                /* Compare Value 2 Register; 0x000018FA */
volatile ADCOFSSTR _ADCOFS;                                /* Offset Correction Register; 0x000018FE */
volatile ADCPGSTR _ADCPG;                                  /* Plus-Side Gain Register; 0x00001900 */
volatile ADCMGSTR _ADCMG;                                  /* Minus-Side Gain Register; 0x00001902 */
volatile ADCCLP4STR _ADCCLP4;                              /* Plus-Side General Calibration Value 4 Register; 0x00001906 */
volatile ADCCLP3STR _ADCCLP3;                              /* Plus-Side General Calibration Value 3 Register; 0x00001908 */
volatile ADCCLM4STR _ADCCLM4;                              /* Minus-Side General Calibration Value 4 Register; 0x00001910 */
volatile ADCCLM3STR _ADCCLM3;                              /* Minus-Side General Calibration Value 3 Register; 0x00001912 */
/* FCHKS - macro for reading non volatile register         Flash Checksum Register; 0x0000FFB8 */
/* Tip for register initialization in the user code:  const byte FCHKS_INIT @0x0000FFB8 = <FCHKS_INITVAL>; */

/*lint -restore */

/* EOF */
